type Lyric = {
  text: string
  showMs: number
}

/**
 * 歌詞
[hook]
君と過ごす夜 少しアーバン
処理速度高速 私から
送るデータは膨大
「無理、受け取れない」
とかダメだよ！ 愛して twinkle night
君と過ごす夜 少しアーバン
甘々なひととき君にオーダー
コマ送り メモリー イルミの前 手を取り
言葉と指を交わそうよ 恋のセオリー

[nyankobrq]
今の暮らしは悪くなる一方です
君と二人暮らす部屋が理想です
うだつが上がらない僕のそばで
ずっと笑ってくれる君が好きです
最高だよ 人生 長い髪切って
君の好きな誰かに合わせて
音楽をかけるよ 僕が DJ の radio
ポルノグラフティ
みたいな感じ！どう？
目と目が会う レーザービーム
漫画的偶然 手が触れた日
放電する二人 電気がバチバチ
特性：蓄電、避雷針
唐突に喋り出す siri
君の言葉の裏 本当の意味
これっきり　ギリギリで
保ってるボクのハート
プラ製でもう溶けそう

[yaca]
ティンクルくるせいだーす
Mars Attacks!　 Zathura ですら
全部架空 ヒエログラフ だって
誰かの解釈 読めるわけないないのにね
”この物語はフィクションです。”
君との遭遇は嘘なんです
Feel All Right 痛くも痒くもない
けど黄色ゲージ、スタミナない
教えて Filmarks
空っぽの人生 星 何点？
欲しがってる満点の星
120 個 いや一個で十分かも
Wow Signal 送り返す
君は返事もくれないまま
炭酸のないサイダー飲み乾せないや まだ

[somunia]
裸足のまま踊る夜
寒くはないけどココアを飲む
誰かが見てる 私も誰かを見てる
いちまるはち、アメと恋とゲーム
最高の friend だ お布団
（ぎゅっぎゅっ）
twinkle night たゆたう
夢遊病患者の寝言
甘い雲はバニラの香りがするんだ
包んだはずの足は寒くて引っ込めた
きっとまたはみ出したままで寝てしまったんだ
末端あったまったらまた
彼方 あなたとなら 九日十日
どうか 音は星を超えた
そっかやっぱ夢か
わかっても瞳は閉じたまま
 */

export const lyrics: Lyric[] = [
  {
    text: '',
    showMs: 0,
  },
  // hook
  {
    text: '君と過ごす夜 少しアーバン 処理速度高速 私から',
    showMs: 2180,
  },
  {
    text: '送るデータは膨大 「無理、受け取れない」とか',
    showMs: 7240,
  },
  {
    text: 'ダメだよ！ 愛してtwinkle night',
    showMs: 11000,
  },
  {
    text: '君と過ごす夜 少しアーバン 甘々なひととき君にオーダー',
    showMs: 13200,
  },
  {
    text: 'コマ送り メモリー イルミの前 手を取り',
    showMs: 18260,
  },
  {
    text: '言葉と指を交わそうよ 恋のセオリー',
    showMs: 21100,
  },
  // nyankobrq
  {
    text: '今の暮らしは悪くなる一方です 君と二人暮らす部屋が理想です',
    showMs: 24270,
  },
  {
    text: 'うだつが上がらない僕のそばで ずっと笑ってくれる君が好きで',
    showMs: 29820,
  },
  {
    text: '最高だよ人生 長い髪切って 君の好きな誰かに合わせて',
    showMs: 36060,
  },
  {
    text: '音楽をかけるよ 僕がDJのradio ポルノグラフティ みたいな感じ！どう？',
    showMs: 41010,
  },
  {
    text: '目と目が会う レーザービーム 漫画的偶然 手が触れた日',
    showMs: 47020,
  },
  {
    text: '放電する二人 電気がバチバチ 特性：蓄電、避雷針',
    showMs: 51900,
  },
  {
    text: '唐突に喋り出すsiri 君の言葉の裏 本当の意味',
    showMs: 58160,
  },
  {
    text: 'これっきり ギリギリで保ってるボクのハート プラ製でもう溶けそう',
    showMs: 63070,
  },
  // hook
  {
    text: '君と過ごす夜 少しアーバン 処理速度高速 私から',
    showMs: 68180,
  },
  {
    text: '送るデータは膨大 「無理、受け取れない」とか',
    showMs: 73310,
  },
  {
    text: 'ダメだよ！ 愛してtwinkle night',
    showMs: 77080,
  },
  {
    text: '君と過ごす夜 少しアーバン 甘々なひととき君にオーダー',
    showMs: 79200,
  },
  {
    text: 'コマ送り メモリー イルミの前 手を取り',
    showMs: 84340,
  },
  {
    text: '言葉と指を交わそうよ 恋のセオリー',
    showMs: 87180,
  },
  // yaca
  {
    text: 'ティンクルくるせいだーす Mars Attacks! Zathuraですら',
    showMs: 91000,
  },
  {
    text: '全部架空 ヒエログラフだって 誰かの解釈 読めるわけないないのにね',
    showMs: 95780,
  },
  {
    text: '”この物語はフィクションです。” 君との遭遇は嘘なんです',
    showMs: 102230,
  },
  {
    text: 'Feel All Right 痛くも痒くもない けど黄色ゲージ、スタミナない',
    showMs: 108040,
  },
  {
    text: '教えてFilmarks 空っぽの人生 星 何点？',
    showMs: 113050,
  },
  {
    text: '欲しがってる満点の星 120個 いや一個で十分かも',
    showMs: 117360,
  },
  {
    text: 'Wow Signal 送り返す 君は返事もくれないまま',
    showMs: 124110,
  },
  {
    text: '炭酸のないサイダー飲み乾せないや まだ',
    showMs: 129100,
  },
  // somunia
  {
    text: '裸足のまま踊る夜 寒くはないけどココアを飲む',
    showMs: 135220,
  },
  {
    text: '誰かが見てる 私も誰かを見てる いちまるはち、アメと恋とゲーム',
    showMs: 140140,
  },
  {
    text: '最高のfriendだ お布団（ぎゅっぎゅっ） twinkle night たゆたう',
    showMs: 146160,
  },
  {
    text: '夢遊病患者の寝言 甘い雲はバニラの香りがするんだ',
    showMs: 151120,
  },
  {
    text: '包んだはずの足は寒くて引っ込めた',
    showMs: 156740,
  },
  {
    text: 'きっとまたはみ出したままで寝てしまったんだ',
    showMs: 160120,
  },
  {
    text: '末端あったまったらまた 彼方',
    showMs: 164760,
  },
  {
    text: 'あなたとなら 九日十日 どうか 音は星を超えた',
    showMs: 168130,
  },
  {
    text: 'そっかやっぱ夢か わかっても瞳は閉じたまま',
    showMs: 173090,
  },
  // hook
  {
    text: '君と過ごす夜 少しアーバン 処理速度高速 私から',
    showMs: 178240,
  },
  {
    text: '送るデータは膨大 「無理、受け取れない」とか',
    showMs: 183770,
  },
  {
    text: 'ダメだよ！ 愛してtwinkle night',
    showMs: 187140,
  },
  {
    text: '君と過ごす夜 少しアーバン 甘々なひととき君にオーダー',
    showMs: 189760,
  },
  {
    text: 'コマ送り メモリー イルミの前 手を取り',
    showMs: 195000,
  },
  {
    text: '言葉と指を交わそうよ 恋のセオリー',
    showMs: 197740,
  },
  {
    text: '',
    showMs: 201110,
  },
]
